Addition of pool causing replacement.

```
astha@Asthas-MBP vpc-terraform-config % tf plan  
ibm_is_vpc.example: Refreshing state... [id=r134-c910e202-a3cd-4ce3-9ab8-97fbd5ca41e3]
ibm_is_subnet.example: Refreshing state... [id=0716-8ff62bca-d447-47ab-a844-4c8e07ccf440]
ibm_is_lb.example: Refreshing state... [id=r134-43183475-0c99-46e9-be62-27644032892f]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # ibm_is_lb.example must be replaced
-/+ resource "ibm_is_lb" "example" {
      ~ access_mode                             = "public" -> (known after apply)
      ~ access_tags                             = [] -> (known after apply)
      ~ availability                            = "subnet" -> (known after apply)
      ~ crn                                     = "crn:v1:staging:public:is:us-south:a/3bf43234b648447d95aa1aee1bc5e73a::load-balancer:r134-43183475-0c99-46e9-be62-27644032892f" -> (known after apply)
      ~ hostname                                = "43183475-us-south.lb.test.appdomain.cloud" -> (known after apply)
      ~ id                                      = "r134-43183475-0c99-46e9-be62-27644032892f" -> (known after apply)
      ~ instance_groups_supported               = true -> (known after apply)
        name                                    = "example-lb"
      ~ operating_status                        = "online" -> (known after apply)
      ~ private_ip                              = [
          - {
              - address       = "10.240.0.4"
              - href          = "https://us-south-stage01.iaasdev.cloud.ibm.com/v1/subnets/0716-8ff62bca-d447-47ab-a844-4c8e07ccf440/reserved_ips/0716-1f49d200-633f-4c94-969a-c5276006ce10"
              - name          = "blouson-energetic-mutate-stagnant"
              - reserved_ip   = "0716-1f49d200-633f-4c94-969a-c5276006ce10"
              - resource_type = "subnet_reserved_ip"
            },
          - {
              - address       = "10.240.0.5"
              - href          = "https://us-south-stage01.iaasdev.cloud.ibm.com/v1/subnets/0716-8ff62bca-d447-47ab-a844-4c8e07ccf440/reserved_ips/0716-e4259998-2606-4b55-bd22-dedf40e19b32"
              - name          = "chased-cornea-mumps-exponent"
              - reserved_ip   = "0716-e4259998-2606-4b55-bd22-dedf40e19b32"
              - resource_type = "subnet_reserved_ip"
            },
        ] -> (known after apply)
      ~ private_ips                             = [
          - "10.240.0.4",
          - "10.240.0.5",
        ] -> (known after apply)
      ~ profile                                 = "dynamic" -> (known after apply)
      ~ public_ips                              = [
          - "169.48.151.79",
          - "174.37.142.142",
        ] -> (known after apply)
      ~ resource_controller_url                 = "https://test.cloud.ibm.com/vpc-ext/network/loadBalancers" -> (known after apply)
      ~ resource_group                          = "8302a7a06e7440d6927383cd7c06e7d2" -> (known after apply)
      ~ resource_group_name                     = "Default" -> (known after apply)
      ~ resource_name                           = "example-lb" -> (known after apply)
      ~ security_group_supported                = true -> (known after apply)
      ~ security_groups                         = [
          - "r134-f977b0df-c3ce-4fbd-852e-ece4169745df",
        ] -> (known after apply)
      ~ source_ip_session_persistence_supported = true -> (known after apply)
      ~ status                                  = "active" -> (known after apply)
      ~ tags                                    = [] -> (known after apply)
      ~ udp_supported                           = false -> (known after apply)
      ~ version                                 = "W/qlfkm8rrmeuoq2eckrv2lkzezhqnvnbusdhsk65wgdnm0xzxe7d4rkwtswtqhzzrib9nwgmylgng7+ywe7bpqa" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ pools { # forces replacement
          ~ name           = "example-pool2" -> "example-pool3"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + pools { # forces replacement
          + algorithm      = "round_robin"
          + name           = "example-pool33"
          + protocol       = "http"
          + proxy_protocol = "v1"

          + health_monitor {
              + delay       = 60
              + max_retries = 5
              + port        = 238
              + timeout     = 30
              + type        = "http"
              + url_path    = "kkk"
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform
apply" now.
astha@Asthas-MBP vpc-terraform-config % 
```